app/Controllers/Admin/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function index()
    {
        $session = session();
        $userId = $session->get('id'); // Usar el método correcto del session
        $data = [
            'user' => $this->userModel->find($userId),
            'title' => 'Perfil',
        ];

UPDATE `users` SET `first_name` = 'Juan David', `last_name` = 'Franco', `email` = 'juanfranco561@gmail.com', `phone` = '611317040', `address` = 'Rúa San José - 14', `profile` = 'Lorem ipsum dolor sit amet consectetur adipiscing elit commodo elementum, ultrices eros velit eget mollis montes sem. Nec hac sed hendrerit urna fusce donec feugiat, sodales leo per arcu metus euismod ridiculus neque, dignissim porttitor viverra cras maecenas dui.'
WHERE `users`.`id` IN ('1')
---
    public function update()
    {
        $session = session();
        $userId = $session->get('id');

        $rules = [
            'first_name' => 'required',
            'last_name' => 'required',
            'email' => 'required|valid_email',
            'phone' => 'required',
            'profile' => 'required',
        ];

        if (!$this->validate($rules)) {
            return $this->response->setJSON([
                'status' => 'error',
                'errors' => $this->validator->getErrors()
            ]);
        }

        $data = [
            'first_name' => $this->request->getPost('first_name'),
            'last_name' => $this->request->getPost('last_name'),
            'email' => $this->request->getPost('email'),
            'phone' => $this->request->getPost('phone'),
            'address' => $this->request->getPost('address'),
            'profile' => $this->request->getPost('profile'),
        ];

        if ($this->userModel->update($userId, $data)) {