app/Controllers/Admin/Settings.php

SELECT *
FROM `settings`
---
    public function index()
    {
        $settings = $this->settingsModel->findAll();