app/Controllers/Admin/Todo.php

    public function index()
    {

        $todos =  $this->TodoModel->findAll();
---
SELECT *
FROM `todos`

    public function add()
    {
        $task = $this->request->getPost('task');
        if ($task) {
            $data = [
                'task' => $task,
                'is_completed' => 0,
                'created_at' => date('Y-m-d H:i:s')
            ];
            $this->TodoModel->save($data);
---
INSERT INTO `todos` (`task`, `is_completed`, `created_at`) VALUES ('Nueva Tarea', 0, '2024-12-13 10:39:57')

    public function delete($id)
    {

        $this->TodoModel->delete($id);
---
DELETE FROM `todos`
WHERE `id` IN ('undefined')