app/Controllers/Admin/Users.php

   public function show($id = null)
   {
      try {
         $data = $this->UsersModel->join('roles', 'roles.id = users.role_id')
            ->find($id);
---
SELECT *
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`id` = '1'

   public function toggleUserStatus()
   {
      // Recibir datos desde la solicitud AJAX
      $request = \Config\Services::request(); // Obtener la instancia de la solicitud
      $userId = $request->getPost('user_id');
      $isActive = $request->getPost('is_active');

      // Validar los datos recibidos
      if ($userId !== null && $isActive !== null) {
         // Actualizar directamente la base de datos
         $updated = $this->db->table('users') // 'users' es el nombre de la tabla
            ->where('id', $userId) // 'id' es la clave primaria
            ->update(['is_active' => $isActive]);
---
UPDATE `users` SET `is_active` = '0'
WHERE `id` = '14'