app/Helpers/global_helper.php

    function get_setting(string $key, $default = null)
    {
        $settingsModel = new SettingsModel();
        $setting = $settingsModel->where('key', $key)->first();
---
SELECT *
FROM `settings`
WHERE `key` = 'logo'
 LIMIT 1