app/Models/UserModel.php

    public function countFilter($search)
    {
        $builder = $this->table($this->table);

        $i = 0;
        foreach ($this->searchFields as $column) {
            if ($search) {
                if ($i == 0) {
                    $builder->groupStart()
                        ->like($column, $search);
                } else {
                    $builder->orLike($column, $search);
                }

                if (count($this->searchFields) - 1 == $i) $builder->groupEnd();
            }
            $i++;
        }

        return $builder->join('roles', 'roles.id = users.role_id')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`